In [28]:
import numpy as np
import pandas as pd

In [64]:
# Read file
titanic_data = pd.read_csv("titanic_data.csv", index_col = "PassengerId")

In [65]:
titanic_data['Pclass'] = titanic_data['Pclass'].replace([1, 2, 3],['Upper Class', 'Middle Class', 'Lower Class'])
titanic_data['Gender'] = titanic_data['Sex'].replace(["male", "female"],["Male", "Female"])
titanic_data['Embarked'] = titanic_data['Embarked'].replace(["C", "S", "Q"], ["Cherbourg", "Southampton", "Queenstown"])
titanic_data.drop(["Name", "SibSp", "Parch", "Ticket", "Fare", "Cabin", "Age", "Sex"], axis = 1, inplace = True)

In [66]:
titanic_data.to_csv("titanic_ClassGenderPort.csv")

In [67]:
titanic_ClassGenderPort = pd.read_csv('titanic_ClassGenderPort.csv')
titanic_ClassGenderPort.head() # see header

   PassengerId  Survived       Pclass     Embarked  Gender
0            1         0  Lower Class  Southampton    Male
1            2         1  Upper Class    Cherbourg  Female
2            3         1  Lower Class  Southampton  Female
3            4         1  Upper Class  Southampton  Female
4            5         0  Lower Class  Southampton    Male

In [68]:
titanic_data.head()

             Survived       Pclass     Embarked  Gender
PassengerId
1                   0  Lower Class  Southampton    Male
2                   1  Upper Class    Cherbourg  Female
3                   1  Lower Class  Southampton  Female
4                   1  Upper Class  Southampton  Female
5                   0  Lower Class  Southampton    Male

In [69]:
group_survived = titanic_data.groupby('Survived')

In [70]:
group_survived.describe()

                    Embarked  Gender       Pclass
Survived
0        count           549     549          549
         unique            3       2            3
         top     Southampton    Male  Lower Class
         freq            427     468          372
1        count           340     342          342
         unique            3       2            3
         top     Southampton  Female  Upper Class
         freq            217     233          136

In [71]:
group_class = titanic_data.groupby('Pclass')
group_class.describe()

                      Survived
Pclass
Lower Class  count  491.000000
             mean     0.242363
             std      0.428949
             min      0.000000
             25%      0.000000
             50%      0.000000
             75%      0.000000
             max      1.000000
Middle Class count  184.000000
             mean     0.472826
             std      0.500623
             min      0.000000
             25%      0.000000
             50%      0.000000
             75%      1.000000
             max      1.000000
Upper Class  count  216.000000
             mean     0.629630
             std      0.484026
             min      0.000000
             25%      0.000000
             50%      1.000000
             75%      1.000000
             max      1.000000

In [139]:
titanic_df = pd.read_csv('titanic_data.csv')
titanic_df = titanic_df.drop('PassengerId', 1)

In [140]:
titanic_df = titanic_df.drop(["Name", "SibSp", "Parch", "Ticket", "Fare", "Cabin", "Age"], 1)

In [141]:
titanic_df.head()

   Survived  Pclass     Sex Embarked
0         0       3    male        S
1         1       1  female        C
2         1       3  female        S
3         1       1  female        S
4         0       3    male        S

In [142]:
titanic_df['Class'] = titanic_df['Pclass'].replace([1, 2, 3],['Upper Class', 'Middle Class', 'Lower Class'])
titanic_df['Gender'] = titanic_df['Sex'].replace(["male", "female"],["Male", "Female"])
titanic_df['Embarked'] = titanic_df['Embarked'].replace(["C", "S", "Q"], ["Cherbourg", "Southampton", "Queenstown"])
titanic_df = titanic_df.drop(["Pclass", "Sex", "Embarked", "Gender"], 1)

In [143]:
titanic_df.head()

   Survived        Class
0         0  Lower Class
1         1  Upper Class
2         1  Lower Class
3         1  Upper Class
4         0  Lower Class

In [144]:
group_joint = titanic_df.groupby(['Class', 'Survived'])

In [146]:
group_joint

In [147]:
group_joint = group_joint.size().reset_index()

In [148]:
group_joint.columns = ['Class', 'Survived', 'Count']
group_joint

          Class  Survived  Count
0   Lower Class         0    372
1   Lower Class         1    119
2  Middle Class         0     97
3  Middle Class         1     87
4   Upper Class         0     80
5   Upper Class         1    136

In [138]:
group_joint.to_csv("titanic_class.csv")